Revit 2027 API
SolidCurveIntersection.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<Curve> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of Curve)
public:
virtual IEnumerator<Curve^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<Curve>
override GetEnumerator : unit -> IEnumerator<Curve>
Return Value
IEnumerator<Curve>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
SolidCurveIntersection Class
Autodesk.Revit.DB Namespace